Tekla.Structures.DialogInternal.ShapeAttibuteRequestHandler
For internal use only !
Rebar attributes request handler

Tekla.Structures.DialogInternal.ShapeAttibuteRequestHandler.#ctor
Construct class

Tekla.Structures.DialogInternal.ShapeAttibuteRequestHandler.AttributeRequestedEvent
The attribute requested event

Tekla.Structures.DialogInternal.ShapeAttibuteRequestHandler.OnAttributeRequestedEvent(Tekla.Structures.DialogInternal.IDialogOwner,System.String)
The attribute requested event
handle: Caller control
shape: Shape name

Tekla.Structures.DialogInternal.ShapeAttibuteRequestHandler.Dispose
Dispose this instance